<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"acd3b897b1d4cf16dc6bede3c1e5eae297ddeb7b4b29e5934d6ec9686a424d9d","plan_job_ref":"Job Terraform format and plan #4 at https://github.com/mahesh1b/gha-for-tf/actions/runs/14282862477","plan_out_hash":"d93ed57b2ffe6f6d396cd49217c214c820a22566c1544c36e1e5f934f9b8eb94","plan_hash":"34cfbd9f640867da61882fdb6e9941e9b26e54dae5d6c20c3071b11e34ed5d49","plan_text_format":"diff","version":"1.48.0","closed":true} -->
Terraform plan in __terraform/sandbox__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.tf_state.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "test-s3-bucket-for-terraform-2025"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.tf_state.aws_s3_bucket_public_access_block.this will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.tf_state.aws_s3_bucket_server_side_encryption_configuration.this will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.tf_state.aws_s3_bucket_versioning.this will be created
+   resource "aws_s3_bucket_versioning" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #2](https://github.com/mahesh1b/gha-for-tf/actions/runs/14282881894)